
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/109naoki/rss-infra/actions/runs/8414779246)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-rss-server]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-091f21a54fc911aba]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-rss-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-035cfa7d06994e758]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-019a1aa7d4f2158c2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-023ebf38354652734]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a8fdfa87f1df4d2c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0f0375cca0d460ec1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-048af904a6d32cb40]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-046d00b4612d31901]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ff4b7cf67029f0dd]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-07d1d80f0ed6bb932]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08f057da2c1e6f29b]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0559881d84db86322]
aws_security_group.ecs: Refreshing state... [id=sg-0c52d53b99ba37ca7]
aws_security_group.alb: Refreshing state... [id=sg-02ec66d913b4fb6e9]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:targetgroup/go-rss-server-target-group/a223748d09ac38bc]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0f6bab745980dd060]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07591b3e6fbcf480f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1514818bf88c6c9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0654f69cb494833ec]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:loadbalancer/app/go-rss-server-alb/9c21f6c7b0c4b8de]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2882790752]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0559881d84db863221080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b8866ccab1204bb6]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07e39ac159916c26b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0171619a4015cf390]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-028455c38671132b7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-046d00b4612d319011080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07d1d80f0ed6bb9321080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:273001585891:listener-rule/app/go-rss-server-alb/9c21f6c7b0c4b8de/af8b4fae608060c0/bb66fce5d939d399]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-rss-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-rss-server"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-rss-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-rss-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:273001585891:targetgroup/go-rss-server-target-group/a223748d09ac38bc"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0c52d53b99ba37ca7",
            ]
          + subnets          = [
              + "subnet-019a1aa7d4f2158c2",
              + "subnet-0a8fdfa87f1df4d2c",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-rss-server"
                          + awslogs-region        = "us-east-1"
                          + awslogs-stream-prefix = "go-rss-server"
                        }
                    }
                  + name             = "go-rss-server"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-rss-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-rss-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-rss-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-rss-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creating...
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-rss-server]
aws_iam_role.ecs_task: Creation complete after 1s [id=go-rss-server-ecs-task]
aws_iam_role.ecs: Creation complete after 1s [id=go-rss-server-ecs]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-rss-server]
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-rss-server-ecs-20240325034524786400000001]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 11s [id=arn:aws:ecs:us-east-1:273001585891:cluster/go-rss-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:us-east-1:273001585891:service/go-rss-server/go-rss-server]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"30e2dddcc2fdc3ccda039fa9df4db873bde3c126","Vars":{},"WorkflowName":"Terraform"} -->